package com.weiruanit.lifepro.module.joke.bean;

import android.os.Parcel;
import android.os.Parcelable;

import java.util.List;

/**
 * Created by Administrator on 2016/11/15 0015.
 */

public class TextJokeBeanResponse {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1160,"ret_code":0,"contentlist":[{"id":"582a88496e36823be6620327","text":"小兔说：\"我是兔娘养的！\"<p><\/p>小猪说：\"我是猪娘养的！\"<p><\/p>小鸡说：\"我是鸡娘养的！\"<p><\/p>小狗说：\"你们聊，我先走了！\"<p><\/p>0号陪练说：\"外人叫我零陪，好听！\"<p><\/p>1号陪练说：\"外人叫我一陪，也好听！\"<p><\/p>2号陪练说：\"外人叫我二陪，也很好听！\"<p><\/p>3号陪练说：\"你们聊，我们先走了！\"<p><\/p>猫对我说：\"我是你奶奶的猫，好听！\"<p><\/p>狗对我说：\"我是你奶奶的狗，也好听！\"<p><\/p>鱼对我说：\"我是你奶奶的鱼，也很好听！\"<p><\/p>熊说：\"你们聊，我先走了！\"<p><\/p>浪客说：\"人们叫我浪人，好听！\"<p><\/p>武士说：\"人们叫我武人，也好听！\"<p><\/p>......","title":"你们聊，我先走了！(经典)","type":1,"ct":"2016-11-15 12:00:09.180"},{"id":"582a88496e36823be6620326","text":"一天早晨，狮子醒后感觉很兴奋。它走出去，把一只小猴子逼到角落里吼道：\u201c谁是森林万兽中最勇猛的？\u201d猴子战战兢兢地回答：\u201c当然是您，勇猛的狮子１<p><\/p>狮子又遇到一只鹿，问了同样的问题，得到了相同的答案。<p><\/p>狮子一路没遇到一个反对者，它大摇大摆地走到一头大象跟前，吼道：\u201c谁是森林万兽中最勇猛的？\u201d<p><\/p>大象快如闪电般用鼻子把狮子一下子卷了起来，朝一棵树上扔了过去，然后慢悠悠的走开了。<p><\/p>狮子冲着大象的背影抱怨道：\u201c喂！就是不知道答案，你也犯不着发这么大的火啊１","title":"谁是森林万兽中最勇猛的?","type":1,"ct":"2016-11-15 12:00:09.178"},{"id":"582a88496e36823be6620322","text":"一天，牛给驴出了一道难题。<p><\/p>牛问驴：\u201c蠢\u201d字下面两只虫子哪只是公的，哪只是母的？<p><\/p>驴绞尽脑汁，还是答不上来。<p><\/p>牛骂道：真是头蠢驴，男左女右嘛！","title":"哪只是公的，哪只是母的？","type":1,"ct":"2016-11-15 12:00:09.019"},{"id":"582a88486e36823be6620321","text":"一个女人在游泳池里游泳。<p><\/p>一青蛙也在游泳，误入女人yd；<p><\/p>数日后青蛙自杀留遗书：此洞不得了！天天大棒捣，顿顿喝米汤，忽多又忽少，想要往外跑，盖着护舒宝，与其这样活，不如死了好。哈哈~~~","title":"超级经典的青蛙遗言 哈哈","type":1,"ct":"2016-11-15 12:00:08.803"},{"id":"582a88486e36823be6620320","text":"话说某位女士一时兴起，买了一只母鹦鹉。没想到带回家里，它说的第一句话就是：\"想跟我上床吗？\"女士一听，心想：坏了，外人还以为这话是我教的呢，这不把我的淑女形象全给毁了。于是她想尽办法，想交那只鹦鹉说些高雅的东西，可是那只母鹦鹉算是铁了心了，只会说一句话：\"想跟我上床吗？\"\u2026\u2026<p><\/p>怎么办呢？在那位女士失去主张的时候，听说神父那里也养了一只鹦鹉（公的），而且那只鹦鹉，不但不讲粗话，反而是个虔诚的教徒，每天大部分时间里都在祷告。于是那位女士去找神父求助。神父明白她的来意之后，面色微难的说：\"这个，很难办呀，其实那只鹦鹉，我也并没有刻意的教它什么，它之所以这么虔诚，也可能是长期在此受熏陶的缘故吧。\"<p><\/p>......","title":"想和我上床吗? (鹦鹉自语...暴笑!)","type":1,"ct":"2016-11-15 12:00:08.803"},{"id":"582a7a506e36823be6618c0e","text":"<p>\r\n\t\t1、迎面走来一位妙龄少女，偶几天来委靡不振的腰板一下挺直了，两眼冒着青光，嘴角流着口水，一颗小心\u201c扑通扑通\u201d的跳着，心想：嘿嘿，是该出手的时候了\u2026\u2026<p><\/p>\r\n于是，一双污秽的黑手伸向了少女\u2026\u2026\u201c姐姐~，可怜可怜我吧，我已经好几天没吃东西了 \u2026\u2026\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天加班在单位食堂午餐，我打完饭，端着午餐经过女神的餐桌前，问她：\u201c要鸡腿不？\u201d<p><\/p>\r\n女神瞟了我一眼：\u201c不要！ \u201d<p><\/p>\r\n于是，我夹走她盘子里的鸡腿，华丽丽滴转身走了，留下女神风中凌乱。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、本人21，去吃饭，吃完结账，我喊一声，大姐，结账！<p><\/p>......","title":"帅男美女,小心你的身边有逗B","type":1,"ct":"2016-11-15 11:00:32.289"},{"id":"582a7a506e36823be6618c0c","text":"<p>\r\n\t\t1、去参加厚脸皮大赛，到了赛场我就直接跑到评委那儿把奖杯抱走了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在酒吧和人起了冲突，对方恶狠狠地说：\u201c信不信我揍你？\u201d 我说我信。<p><\/p>......","title":"傲娇的爆笑逗B","type":1,"ct":"2016-11-15 11:00:32.289"},{"id":"582a7a506e36823be6618c0b","text":"<p>\r\n\t\t1、看了苹果发布会之后，我准备把iPhone5送给我女朋友，然后再买个iPhone5s或者iPhone5C，跟朋友商量买哪个好。<p><\/p>......","title":"屌丝的我,苦B就是欢乐","type":1,"ct":"2016-11-15 11:00:32.232"},{"id":"582a7a506e36823be6618c04","text":"<p>\r\n\t\t1、路上遇到一女神级妹子，就快步上前不停的回头偷看，那妹子被看烦了就说：看够了吗？<p><\/p>\r\n我一激动就说：中看不知道中用么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、A：什么时候结婚啊？<p><\/p>\r\nB：等工资多点再说吧！<p><\/p>\r\nA：你俩现在多少工资啊？<p><\/p>\r\nB：加一起一万两千多～<p><\/p>\r\nA：我去，这么多可以结了埃<p><\/p>\r\nB：她一万，我两千多～<p><\/p>\r\nA：\u2026\u2026\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天拉着妹子去开房，万般激动打开房间门一看，床塌了，果断找前台去问：\u201c你们房间床塌了\u201d。<p><\/p>\r\n前台：\u201c先生，这需要照价赔偿的。\u201d<p><\/p>......","title":"逗B男女,搞笑也这么霸气","type":1,"ct":"2016-11-15 11:00:32.166"},{"id":"582a7a506e36823be6618bfa","text":"<p>\r\n\t\t1、谁说在街上看到拿脉动的妹子就能随便搭讪的？＃。。尼玛，脸到现在还火辣辣的疼！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天查酒驾，一女车主，她问我受伤了用酒精消毒算不算酒驾？<p><\/p>\r\n我很肯定的告诉她说不算，问她伤到哪里了，她说伤了心，我竟无言以对\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天在公司，有一女同事妹子画了个烟熏妆让我评论。<p><\/p>\r\n我说像贞子，妹子问我贞子是谁，我说是日本电影里面的。<p><\/p>\r\n妹子脸一红，啐我一口，骂我流氓\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一天，在一个静谧的胡同巷子里，一妹子正不紧不慢地走着，忽然。。。<p><\/p>......","title":"爆囧:让人生畏的二货妹子","type":1,"ct":"2016-11-15 11:00:32.097"},{"id":"582a7a4f6e36823be6618be8","text":"<p>\r\n\t\t1、土豪：\u201c你造么？!我现在在巴厘岛。\u201d<p><\/p>\r\n屌丝：\u201c哦，我离你也就五里地吧。\u201d&nbsp;<p><\/p>\r\n土豪：\u201c啥？你也出国了？\u201d<p><\/p>\r\n屌丝：\u201c我在三里屯。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女友抱怨：\u201c你的家怎么在这样一个鸟不拉屎的地方？\u201d<p><\/p>\r\n我用食指轻轻地堵住她的嘴巴，嗤笑道：\u201c你尝尝，这是什么？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、几人去郊游，休息的时候口渴了，我就喊了句：谁有水啊？<p><\/p>\r\n我一心仪已久的妹子喊道：来我这！我水多！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c现在人都怎么了？人家不就想搭个顺风车吗，居然光天化日之下把人活活打死了！ \u201d<p><\/p>......","title":"爆笑冷思维,逗你乐开怀","type":1,"ct":"2016-11-15 11:00:31.624"},{"id":"582a7a4f6e36823be6618be7","text":"<p>\r\n\t\t1、和美女同事出差，白天跑一天办正事，晚上一起吃了当地特色小吃，又一起逛了当地夜景。<p><\/p>\r\n回酒店后刚洗完澡，她发一短信过来，说累一天腰酸背痛，问我可不可以过去帮她捏捏背。。。<p><\/p>\r\n老子直接关机，尼玛的都是人，又不是就你一个人跑一天，凭啥让别人伺候你？！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一次晚上送女神回家，她说太晚了，要不就在我这睡，而且晚上开车也不安全，我一听这话顿时就火了，我TM开了几年车了还怕晚上？气得我扭头就走，车链子都蹬断了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、公司最近来一女神，一屌丝同事去搭讪：\u201c妹妹，你长的很像一个人。\u201d<p><\/p>......","title":"他们这是得了屌丝病么?","type":1,"ct":"2016-11-15 11:00:31.587"},{"id":"582a7a4f6e36823be6618be2","text":"<p>\r\n\t\t1、我：昨晚出去吃饭，没想到和别人打了起来，那人一刀就砍了过来，幸亏我女朋友帮我挡了一下，缝了七针\u2026\u2026<p><\/p>\r\n朋友：真羡慕你找一个敢为你挺身而出的女朋友，你一定不能辜负她啊！她现在没事吧？<p><\/p>\r\n我举起右手说：没多大事，现在正要去医院换药呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、下午食堂吃面条，一妹子把我要的端走了。。。<p><\/p>\r\n厨师大叔说你端人家的面干嘛，人家付过钱了！！！<p><\/p>\r\n妹子头也不回的来一句，大不了我赔他一碗。<p><\/p>\r\n当时我就想说，好啊好啊，半晚就行了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天老婆纳闷问她男人：\u201c为什么小孩生下来会哭呢？\u201d<p><\/p>......","title":"内涵幽默,特没正经的男女","type":1,"ct":"2016-11-15 11:00:31.586"},{"id":"582a7a4f6e36823be6618bdf","text":"<p>\r\n\t\t1、女友：\u201c你妈妈和我一起掉水里，你先救谁？\u201d<p><\/p>\r\n男：\u201c无聊，老是这样问，就不会换个问法？\u201d<p><\/p>\r\n女友：\u201c哦，当你老婆和你老妈吵架时，你会把谁扔水里？\u201d&nbsp;<p><\/p>\r\n男。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、和女朋友逛超市吵架，我一拉她，她回头来了一句：\u201c姐夫，你别这样好不好。\u201d<p><\/p>\r\n顿时周围的大妈对我投来了异样的目光，我一怔，大声的说：\u201c要不是当年你勾引我，我会和你姐姐离婚吗？\u201d<p><\/p>\r\n马上大妈们开始对她指指点点，然后女朋友红着脸拉着我走了。<p><\/p>\r\n小样，我还治不了你了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、女：如果恋爱不牵手，不接吻，不上床，就不是恋爱，爱一个人的表现真的要这些身体接触吗？&nbsp;<p><\/p>......","title":"情侣爆笑,非一般的逗B","type":1,"ct":"2016-11-15 11:00:31.585"},{"id":"582a73b86e36823be6617753","title":"亲爱的，我们再也回不","text":"亲爱的，我们再也回不去了，对不对？\r\n我沉思片刻，一巴掌扇了过去：你他妈又把钥匙锁屋里了？","type":1,"ct":"2016-11-15 10:32:24.681"},{"id":"582a73b86e36823be6617752","text":"<p>\r\n\t\t1、\u201c盲人拉屎的时候怎么判断自己的屁股有没有擦干净？\u201d<p><\/p>\r\n\u201c你以为导盲犬只管带路？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、下次尿尿千万不要想把坑边上的苍蝇给射湿冲进坑里，原来苍蝇翅膀湿了也能飞起来，不要问我怎么知道的，洗脸去。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天两个同事在开玩笑，一个说：\u201c你好像一坨屎啊！ \u201d<p><\/p>\r\n另一个说：\u201c你好像一个屁啊！ \u201d<p><\/p>\r\n我听了不由自主的接道：\u201c本是同根生，相煎何太急\u2026\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、和女友在火车站候车，凑一起亲密。女友伸出手，我亲了一下，TM的她大笑，说上厕所没洗手！<p><\/p>......","title":"臭气熏天的恶心段子","type":1,"ct":"2016-11-15 10:32:24.552"},{"id":"582a73b86e36823be6617751","text":"<p>\r\n\t\t1、在朋友口中得知前女友过得不好，心里挺过意不去，毕竟是我甩的她，便打电话问她：\u201c过得好么？\u201d<p><\/p>\r\n前女友道：\u201c不好！ \u201d<p><\/p>\r\n我便又问道：\u201c还恨我么？\u201d<p><\/p>\r\n前女友又道：\u201c我一直都不恨你，并且我还很关心你，每次听见死人的时候，我都会上前去看是不是你！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女生偷偷录下暗恋的男生的声音，设成清早的闹铃，这样每天就像是被他亲自叫醒一样呢，她幸福地想道。<p><\/p>\r\n就这样过了一星期，她再也不喜欢他了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c为什么男人一见到大胸的女人，眼睛就看直了？\u201d<p><\/p>......","title":"幽默里的男女,可笑可笑","type":1,"ct":"2016-11-15 10:32:24.552"},{"id":"582a73b86e36823be6617750","text":"<p>\r\n\t\t1、几个朋友相约去爬山，大家怕负重，没多带水，不一会就又累又渴了。<p><\/p>\r\n到了山顶，一个朋友焦躁地问：哪里能小便呀？<p><\/p>\r\n我憋一路了！另一个哥们儿听了，怒道：我们都渴成这样，你还小便，炫富啊？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在朋友圈问大家\u201c如果有人拿着你以前只穿内衣和一个男人的床照勒索你，跟你要钱，你不给就发网上，你咋办。\u201d<p><\/p>\r\n所有人都问了我三个直击灵魂的问题\u201c我当时瘦吗？\u201d\u201c内衣好看吗？\u201d\u201c那男的帅吗？\u201d<p><\/p>\r\n要是答案都是yes那爱TM发哪发哪，他不发我自己还发呢。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c同事炫耀他老婆的妹妹的老公身家过亿。\u201d<p><\/p>......","title":"爆笑的炫富和炫耀","type":1,"ct":"2016-11-15 10:32:24.253"},{"id":"582a73b86e36823be661774f","text":"<p>\r\n\t\t1、刚才惹女友生气，她躺在床上不愿出门吃饭了。<p><\/p>\r\n我知道硬拉她肯定不行，就说了句：\u201c那我走了啊！ \u201d<p><\/p>\r\n开门假装一个人走，希望她能跟上。<p><\/p>\r\n反复来了十几次之后，她终于不再无动于衷，坐起来说：\u201c麻烦你穿条裤子再演，好吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我下班后向女友哭诉：我朋友都说我是扑克脸。女朋友看了看我，左右手一起轮过来，两边各一巴掌，\u201c一对五。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、那天跟女友吵架，我大吼道：\u201c实话跟你说，比你漂亮的人多得是，比你体贴的人多得是，但是我都没心动，为什么？\u201d<p><\/p>......","title":"爆冷的二货男和犀利女","type":1,"ct":"2016-11-15 10:32:24.252"},{"id":"582a73b76e36823be661774c","text":"<p>\r\n\t\t1、睡得正迷糊，猛的一颠簸醒了过来，以为公交车过站了，仔细一看才发现虚惊一场，吓得方向盘上都是我的手汗。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我现在脾气暴躁，看什么都不顺眼，心慌气短，心律不齐，呼吸急促，头晕眼花，想杀人又有濒死感，根据我的医学常识，我判断我应该是太饿了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、昨天半夜回来，在小区楼下转了两三圈没见停车位，对着楼上大喊了一嗓子：你老公回来啦！三分钟不到，十几台车开走了。妹的，只要思想不滑坡，办法总比困难多。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、去医院看病，医生说我病得不轻，我吓坏了，连忙站到体重计上称了一下，果然重了不少！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、今天请朋友吃饭，席间其乐融融相交甚欢<p><\/p>......","title":"逗B让你一身热汗进去,满头冷汗出来","type":1,"ct":"2016-11-15 10:32:23.912"}],"currentPage":1,"allNum":23186,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allPages : 1160
     * ret_code : 0
     * contentlist : [{"id":"582a88496e36823be6620327","text":"小兔说：\"我是兔娘养的！\"<p><\/p>小猪说：\"我是猪娘养的！\"<p><\/p>小鸡说：\"我是鸡娘养的！\"<p><\/p>小狗说：\"你们聊，我先走了！\"<p><\/p>0号陪练说：\"外人叫我零陪，好听！\"<p><\/p>1号陪练说：\"外人叫我一陪，也好听！\"<p><\/p>2号陪练说：\"外人叫我二陪，也很好听！\"<p><\/p>3号陪练说：\"你们聊，我们先走了！\"<p><\/p>猫对我说：\"我是你奶奶的猫，好听！\"<p><\/p>狗对我说：\"我是你奶奶的狗，也好听！\"<p><\/p>鱼对我说：\"我是你奶奶的鱼，也很好听！\"<p><\/p>熊说：\"你们聊，我先走了！\"<p><\/p>浪客说：\"人们叫我浪人，好听！\"<p><\/p>武士说：\"人们叫我武人，也好听！\"<p><\/p>......","title":"你们聊，我先走了！(经典)","type":1,"ct":"2016-11-15 12:00:09.180"},{"id":"582a88496e36823be6620326","text":"一天早晨，狮子醒后感觉很兴奋。它走出去，把一只小猴子逼到角落里吼道：\u201c谁是森林万兽中最勇猛的？\u201d猴子战战兢兢地回答：\u201c当然是您，勇猛的狮子１<p><\/p>狮子又遇到一只鹿，问了同样的问题，得到了相同的答案。<p><\/p>狮子一路没遇到一个反对者，它大摇大摆地走到一头大象跟前，吼道：\u201c谁是森林万兽中最勇猛的？\u201d<p><\/p>大象快如闪电般用鼻子把狮子一下子卷了起来，朝一棵树上扔了过去，然后慢悠悠的走开了。<p><\/p>狮子冲着大象的背影抱怨道：\u201c喂！就是不知道答案，你也犯不着发这么大的火啊１","title":"谁是森林万兽中最勇猛的?","type":1,"ct":"2016-11-15 12:00:09.178"},{"id":"582a88496e36823be6620322","text":"一天，牛给驴出了一道难题。<p><\/p>牛问驴：\u201c蠢\u201d字下面两只虫子哪只是公的，哪只是母的？<p><\/p>驴绞尽脑汁，还是答不上来。<p><\/p>牛骂道：真是头蠢驴，男左女右嘛！","title":"哪只是公的，哪只是母的？","type":1,"ct":"2016-11-15 12:00:09.019"},{"id":"582a88486e36823be6620321","text":"一个女人在游泳池里游泳。<p><\/p>一青蛙也在游泳，误入女人yd；<p><\/p>数日后青蛙自杀留遗书：此洞不得了！天天大棒捣，顿顿喝米汤，忽多又忽少，想要往外跑，盖着护舒宝，与其这样活，不如死了好。哈哈~~~","title":"超级经典的青蛙遗言 哈哈","type":1,"ct":"2016-11-15 12:00:08.803"},{"id":"582a88486e36823be6620320","text":"话说某位女士一时兴起，买了一只母鹦鹉。没想到带回家里，它说的第一句话就是：\"想跟我上床吗？\"女士一听，心想：坏了，外人还以为这话是我教的呢，这不把我的淑女形象全给毁了。于是她想尽办法，想交那只鹦鹉说些高雅的东西，可是那只母鹦鹉算是铁了心了，只会说一句话：\"想跟我上床吗？\"\u2026\u2026<p><\/p>怎么办呢？在那位女士失去主张的时候，听说神父那里也养了一只鹦鹉（公的），而且那只鹦鹉，不但不讲粗话，反而是个虔诚的教徒，每天大部分时间里都在祷告。于是那位女士去找神父求助。神父明白她的来意之后，面色微难的说：\"这个，很难办呀，其实那只鹦鹉，我也并没有刻意的教它什么，它之所以这么虔诚，也可能是长期在此受熏陶的缘故吧。\"<p><\/p>......","title":"想和我上床吗? (鹦鹉自语...暴笑!)","type":1,"ct":"2016-11-15 12:00:08.803"},{"id":"582a7a506e36823be6618c0e","text":"<p>\r\n\t\t1、迎面走来一位妙龄少女，偶几天来委靡不振的腰板一下挺直了，两眼冒着青光，嘴角流着口水，一颗小心\u201c扑通扑通\u201d的跳着，心想：嘿嘿，是该出手的时候了\u2026\u2026<p><\/p>\r\n于是，一双污秽的黑手伸向了少女\u2026\u2026\u201c姐姐~，可怜可怜我吧，我已经好几天没吃东西了 \u2026\u2026\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天加班在单位食堂午餐，我打完饭，端着午餐经过女神的餐桌前，问她：\u201c要鸡腿不？\u201d<p><\/p>\r\n女神瞟了我一眼：\u201c不要！ \u201d<p><\/p>\r\n于是，我夹走她盘子里的鸡腿，华丽丽滴转身走了，留下女神风中凌乱。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、本人21，去吃饭，吃完结账，我喊一声，大姐，结账！<p><\/p>......","title":"帅男美女,小心你的身边有逗B","type":1,"ct":"2016-11-15 11:00:32.289"},{"id":"582a7a506e36823be6618c0c","text":"<p>\r\n\t\t1、去参加厚脸皮大赛，到了赛场我就直接跑到评委那儿把奖杯抱走了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在酒吧和人起了冲突，对方恶狠狠地说：\u201c信不信我揍你？\u201d 我说我信。<p><\/p>......","title":"傲娇的爆笑逗B","type":1,"ct":"2016-11-15 11:00:32.289"},{"id":"582a7a506e36823be6618c0b","text":"<p>\r\n\t\t1、看了苹果发布会之后，我准备把iPhone5送给我女朋友，然后再买个iPhone5s或者iPhone5C，跟朋友商量买哪个好。<p><\/p>......","title":"屌丝的我,苦B就是欢乐","type":1,"ct":"2016-11-15 11:00:32.232"},{"id":"582a7a506e36823be6618c04","text":"<p>\r\n\t\t1、路上遇到一女神级妹子，就快步上前不停的回头偷看，那妹子被看烦了就说：看够了吗？<p><\/p>\r\n我一激动就说：中看不知道中用么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、A：什么时候结婚啊？<p><\/p>\r\nB：等工资多点再说吧！<p><\/p>\r\nA：你俩现在多少工资啊？<p><\/p>\r\nB：加一起一万两千多～<p><\/p>\r\nA：我去，这么多可以结了埃<p><\/p>\r\nB：她一万，我两千多～<p><\/p>\r\nA：\u2026\u2026\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天拉着妹子去开房，万般激动打开房间门一看，床塌了，果断找前台去问：\u201c你们房间床塌了\u201d。<p><\/p>\r\n前台：\u201c先生，这需要照价赔偿的。\u201d<p><\/p>......","title":"逗B男女,搞笑也这么霸气","type":1,"ct":"2016-11-15 11:00:32.166"},{"id":"582a7a506e36823be6618bfa","text":"<p>\r\n\t\t1、谁说在街上看到拿脉动的妹子就能随便搭讪的？＃。。尼玛，脸到现在还火辣辣的疼！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天查酒驾，一女车主，她问我受伤了用酒精消毒算不算酒驾？<p><\/p>\r\n我很肯定的告诉她说不算，问她伤到哪里了，她说伤了心，我竟无言以对\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天在公司，有一女同事妹子画了个烟熏妆让我评论。<p><\/p>\r\n我说像贞子，妹子问我贞子是谁，我说是日本电影里面的。<p><\/p>\r\n妹子脸一红，啐我一口，骂我流氓\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一天，在一个静谧的胡同巷子里，一妹子正不紧不慢地走着，忽然。。。<p><\/p>......","title":"爆囧:让人生畏的二货妹子","type":1,"ct":"2016-11-15 11:00:32.097"},{"id":"582a7a4f6e36823be6618be8","text":"<p>\r\n\t\t1、土豪：\u201c你造么？!我现在在巴厘岛。\u201d<p><\/p>\r\n屌丝：\u201c哦，我离你也就五里地吧。\u201d&nbsp;<p><\/p>\r\n土豪：\u201c啥？你也出国了？\u201d<p><\/p>\r\n屌丝：\u201c我在三里屯。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女友抱怨：\u201c你的家怎么在这样一个鸟不拉屎的地方？\u201d<p><\/p>\r\n我用食指轻轻地堵住她的嘴巴，嗤笑道：\u201c你尝尝，这是什么？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、几人去郊游，休息的时候口渴了，我就喊了句：谁有水啊？<p><\/p>\r\n我一心仪已久的妹子喊道：来我这！我水多！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c现在人都怎么了？人家不就想搭个顺风车吗，居然光天化日之下把人活活打死了！ \u201d<p><\/p>......","title":"爆笑冷思维,逗你乐开怀","type":1,"ct":"2016-11-15 11:00:31.624"},{"id":"582a7a4f6e36823be6618be7","text":"<p>\r\n\t\t1、和美女同事出差，白天跑一天办正事，晚上一起吃了当地特色小吃，又一起逛了当地夜景。<p><\/p>\r\n回酒店后刚洗完澡，她发一短信过来，说累一天腰酸背痛，问我可不可以过去帮她捏捏背。。。<p><\/p>\r\n老子直接关机，尼玛的都是人，又不是就你一个人跑一天，凭啥让别人伺候你？！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一次晚上送女神回家，她说太晚了，要不就在我这睡，而且晚上开车也不安全，我一听这话顿时就火了，我TM开了几年车了还怕晚上？气得我扭头就走，车链子都蹬断了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、公司最近来一女神，一屌丝同事去搭讪：\u201c妹妹，你长的很像一个人。\u201d<p><\/p>......","title":"他们这是得了屌丝病么?","type":1,"ct":"2016-11-15 11:00:31.587"},{"id":"582a7a4f6e36823be6618be2","text":"<p>\r\n\t\t1、我：昨晚出去吃饭，没想到和别人打了起来，那人一刀就砍了过来，幸亏我女朋友帮我挡了一下，缝了七针\u2026\u2026<p><\/p>\r\n朋友：真羡慕你找一个敢为你挺身而出的女朋友，你一定不能辜负她啊！她现在没事吧？<p><\/p>\r\n我举起右手说：没多大事，现在正要去医院换药呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、下午食堂吃面条，一妹子把我要的端走了。。。<p><\/p>\r\n厨师大叔说你端人家的面干嘛，人家付过钱了！！！<p><\/p>\r\n妹子头也不回的来一句，大不了我赔他一碗。<p><\/p>\r\n当时我就想说，好啊好啊，半晚就行了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天老婆纳闷问她男人：\u201c为什么小孩生下来会哭呢？\u201d<p><\/p>......","title":"内涵幽默,特没正经的男女","type":1,"ct":"2016-11-15 11:00:31.586"},{"id":"582a7a4f6e36823be6618bdf","text":"<p>\r\n\t\t1、女友：\u201c你妈妈和我一起掉水里，你先救谁？\u201d<p><\/p>\r\n男：\u201c无聊，老是这样问，就不会换个问法？\u201d<p><\/p>\r\n女友：\u201c哦，当你老婆和你老妈吵架时，你会把谁扔水里？\u201d&nbsp;<p><\/p>\r\n男。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、和女朋友逛超市吵架，我一拉她，她回头来了一句：\u201c姐夫，你别这样好不好。\u201d<p><\/p>\r\n顿时周围的大妈对我投来了异样的目光，我一怔，大声的说：\u201c要不是当年你勾引我，我会和你姐姐离婚吗？\u201d<p><\/p>\r\n马上大妈们开始对她指指点点，然后女朋友红着脸拉着我走了。<p><\/p>\r\n小样，我还治不了你了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、女：如果恋爱不牵手，不接吻，不上床，就不是恋爱，爱一个人的表现真的要这些身体接触吗？&nbsp;<p><\/p>......","title":"情侣爆笑,非一般的逗B","type":1,"ct":"2016-11-15 11:00:31.585"},{"id":"582a73b86e36823be6617753","title":"亲爱的，我们再也回不","text":"亲爱的，我们再也回不去了，对不对？\r\n我沉思片刻，一巴掌扇了过去：你他妈又把钥匙锁屋里了？","type":1,"ct":"2016-11-15 10:32:24.681"},{"id":"582a73b86e36823be6617752","text":"<p>\r\n\t\t1、\u201c盲人拉屎的时候怎么判断自己的屁股有没有擦干净？\u201d<p><\/p>\r\n\u201c你以为导盲犬只管带路？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、下次尿尿千万不要想把坑边上的苍蝇给射湿冲进坑里，原来苍蝇翅膀湿了也能飞起来，不要问我怎么知道的，洗脸去。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天两个同事在开玩笑，一个说：\u201c你好像一坨屎啊！ \u201d<p><\/p>\r\n另一个说：\u201c你好像一个屁啊！ \u201d<p><\/p>\r\n我听了不由自主的接道：\u201c本是同根生，相煎何太急\u2026\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、和女友在火车站候车，凑一起亲密。女友伸出手，我亲了一下，TM的她大笑，说上厕所没洗手！<p><\/p>......","title":"臭气熏天的恶心段子","type":1,"ct":"2016-11-15 10:32:24.552"},{"id":"582a73b86e36823be6617751","text":"<p>\r\n\t\t1、在朋友口中得知前女友过得不好，心里挺过意不去，毕竟是我甩的她，便打电话问她：\u201c过得好么？\u201d<p><\/p>\r\n前女友道：\u201c不好！ \u201d<p><\/p>\r\n我便又问道：\u201c还恨我么？\u201d<p><\/p>\r\n前女友又道：\u201c我一直都不恨你，并且我还很关心你，每次听见死人的时候，我都会上前去看是不是你！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女生偷偷录下暗恋的男生的声音，设成清早的闹铃，这样每天就像是被他亲自叫醒一样呢，她幸福地想道。<p><\/p>\r\n就这样过了一星期，她再也不喜欢他了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c为什么男人一见到大胸的女人，眼睛就看直了？\u201d<p><\/p>......","title":"幽默里的男女,可笑可笑","type":1,"ct":"2016-11-15 10:32:24.552"},{"id":"582a73b86e36823be6617750","text":"<p>\r\n\t\t1、几个朋友相约去爬山，大家怕负重，没多带水，不一会就又累又渴了。<p><\/p>\r\n到了山顶，一个朋友焦躁地问：哪里能小便呀？<p><\/p>\r\n我憋一路了！另一个哥们儿听了，怒道：我们都渴成这样，你还小便，炫富啊？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、在朋友圈问大家\u201c如果有人拿着你以前只穿内衣和一个男人的床照勒索你，跟你要钱，你不给就发网上，你咋办。\u201d<p><\/p>\r\n所有人都问了我三个直击灵魂的问题\u201c我当时瘦吗？\u201d\u201c内衣好看吗？\u201d\u201c那男的帅吗？\u201d<p><\/p>\r\n要是答案都是yes那爱TM发哪发哪，他不发我自己还发呢。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c同事炫耀他老婆的妹妹的老公身家过亿。\u201d<p><\/p>......","title":"爆笑的炫富和炫耀","type":1,"ct":"2016-11-15 10:32:24.253"},{"id":"582a73b86e36823be661774f","text":"<p>\r\n\t\t1、刚才惹女友生气，她躺在床上不愿出门吃饭了。<p><\/p>\r\n我知道硬拉她肯定不行，就说了句：\u201c那我走了啊！ \u201d<p><\/p>\r\n开门假装一个人走，希望她能跟上。<p><\/p>\r\n反复来了十几次之后，她终于不再无动于衷，坐起来说：\u201c麻烦你穿条裤子再演，好吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我下班后向女友哭诉：我朋友都说我是扑克脸。女朋友看了看我，左右手一起轮过来，两边各一巴掌，\u201c一对五。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、那天跟女友吵架，我大吼道：\u201c实话跟你说，比你漂亮的人多得是，比你体贴的人多得是，但是我都没心动，为什么？\u201d<p><\/p>......","title":"爆冷的二货男和犀利女","type":1,"ct":"2016-11-15 10:32:24.252"},{"id":"582a73b76e36823be661774c","text":"<p>\r\n\t\t1、睡得正迷糊，猛的一颠簸醒了过来，以为公交车过站了，仔细一看才发现虚惊一场，吓得方向盘上都是我的手汗。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我现在脾气暴躁，看什么都不顺眼，心慌气短，心律不齐，呼吸急促，头晕眼花，想杀人又有濒死感，根据我的医学常识，我判断我应该是太饿了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、昨天半夜回来，在小区楼下转了两三圈没见停车位，对着楼上大喊了一嗓子：你老公回来啦！三分钟不到，十几台车开走了。妹的，只要思想不滑坡，办法总比困难多。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、去医院看病，医生说我病得不轻，我吓坏了，连忙站到体重计上称了一下，果然重了不少！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、今天请朋友吃饭，席间其乐融融相交甚欢<p><\/p>......","title":"逗B让你一身热汗进去,满头冷汗出来","type":1,"ct":"2016-11-15 10:32:23.912"}]
     * currentPage : 1
     * allNum : 23186
     * maxResult : 20
     */

    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        /**
         * id : 582a88496e36823be6620327
         * text : 小兔说："我是兔娘养的！"<p></p>小猪说："我是猪娘养的！"<p></p>小鸡说："我是鸡娘养的！"<p></p>小狗说："你们聊，我先走了！"<p></p>0号陪练说："外人叫我零陪，好听！"<p></p>1号陪练说："外人叫我一陪，也好听！"<p></p>2号陪练说："外人叫我二陪，也很好听！"<p></p>3号陪练说："你们聊，我们先走了！"<p></p>猫对我说："我是你奶奶的猫，好听！"<p></p>狗对我说："我是你奶奶的狗，也好听！"<p></p>鱼对我说："我是你奶奶的鱼，也很好听！"<p></p>熊说："你们聊，我先走了！"<p></p>浪客说："人们叫我浪人，好听！"<p></p>武士说："人们叫我武人，也好听！"<p></p>......
         * title : 你们聊，我先走了！(经典)
         * type : 1
         * ct : 2016-11-15 12:00:09.180
         */

        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean implements Parcelable {
            private String id;
            private String text;
            private String title;
            private int type;
            private String ct;

            protected ContentlistBean(Parcel in) {
                id = in.readString();
                text = in.readString();
                title = in.readString();
                type = in.readInt();
                ct = in.readString();
            }

            public static final Creator<ContentlistBean> CREATOR = new Creator<ContentlistBean>() {
                @Override
                public ContentlistBean createFromParcel(Parcel in) {
                    return new ContentlistBean(in);
                }

                @Override
                public ContentlistBean[] newArray(int size) {
                    return new ContentlistBean[size];
                }
            };

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }

            @Override
            public int describeContents() {
                return 0;
            }

            @Override
            public void writeToParcel(Parcel dest, int flags) {
                dest.writeString(id);
                dest.writeString(text);
                dest.writeString(title);
                dest.writeInt(type);
                dest.writeString(ct);
            }
        }
    }
}
